pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_esm.c
/*******************************************************************************
**+--------------------------------------------------------------------------+**
**|                                                                          |**
**|         Copyright (c) 2012 Texas Instruments Incorporated                |**
**|                        ALL RIGHTS RESERVED                               |**
**|                                                                          |**
**| Permission is hereby granted to licensees of Texas Instruments           |**
**| Incorporated (TI) products to use this computer program for the sole     |**
**| purpose of implementing a licensee product based on TI products.         |**
**| No other rights to reproduce, use, or disseminate this computer          |**
**| program, whether in part or in whole, are granted.                       |**
**|                                                                          |**
**| TI makes no representation or warranties with respect to the             |**
**| performance of this computer program, and specifically disclaims         |**
**| any responsibility for any damages, special or consequential,            |**
**| connected with the use of this program.                                  |**
**|                                                                          |**
**+--------------------------------------------------------------------------+**
*******************************************************************************/
/**
 * @file        sl_esm.c
 * @version     2.2.0
 * @brief       File contains esm handling and interrupt handlers for esm errors
 *
 * @details This file implements interrupt handlers for the esmHigh and esmLow interrupts\n
 * the esm group 2 and group 1 handlers have been implemented which can be further extended\n
 * depending on the end application.It provides the Init function which updates the application\n
 * callback function and the interrupt handlers for esmHigh and esmLow interrupt.It also provides\n
 * API's which provide the information on the nerror pin status
 */

/* Comments regarding various justificatios for deviation from MISRA-C coding guidelines
 * are provided at the bottom of the file
 */

#include <sl_api.h>
#include <sl_priv.h>
#if FUNCTION_PROFILING_ENABLED
#include "sl_sys_pmu.h"
#endif

#ifdef __IAR_SYSTEMS_ICC__
__fiq
#endif
static
void sl_esm_high_intr_handler(void);
#ifdef __IAR_SYSTEMS_ICC__
__irq
#endif
static
void sl_esm_low_intr_handler(void);
static
void esmGroup1Handler(uint8 esmChannel);
static
void esmGroup2Handler(uint8 esmChannel);

/*SAFETYMCUSW 298 S MR:- <APPROVED> Comment_1*/
static ESM_Application_Callback ESM_AppCallback;
static uint32 callbackCancelCount = 0u;

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_2*/
void SL_ESM_Init(ESM_Application_Callback appCallback)
{
	/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_2*/
	sl_vimRAM->ISR[1]  = &sl_esm_high_intr_handler;
	sl_vimRAM->ISR[21] = &sl_esm_low_intr_handler;
	ESM_AppCallback = appCallback;
}

boolean SL_ESM_nERROR_Active(void)
{
    boolean retval = FALSE;
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
    if(ESM_ERROR_PIN_OFF== BF_GET(sl_esmREG->EPSR,BF_EPSF_START,BF_EPSF_LENGTH)) {
        retval = FALSE;
    }
    else {
        retval = TRUE;
    }
	return(retval);
}

/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_3*/
#ifdef __TI_COMPILER_VERSION__
#pragma CODE_STATE(sl_esm_high_intr_handler, 32)
#endif
#ifdef __IAR_SYSTEMS_ICC__
__arm
#endif
/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_3*/
#ifdef __TI_COMPILER_VERSION__
#pragma INTERRUPT(sl_esm_high_intr_handler, FIQ)
#endif
#ifdef __IAR_SYSTEMS_ICC__
__fiq
#endif
static void sl_esm_high_intr_handler(void)
{
    register uint8  esmOffH,esmChannel;
#if FUNCTION_PROFILING_ENABLED
    register uint32 entrytick=0u;
    entrytick = _sl_pmuGetCycleCount_();
#endif
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
    esmOffH = (uint8) sl_esmREG->IOFFHR;

    if (0u != esmOffH) {
        esmOffH--;
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        if (esmOffH >= 128u && esmOffH < 160u) {
            /* Group 1 channel 64 to 95 */
        	esmChannel = esmOffH - 64u;
        	esmGroup1Handler(esmChannel);
        } else 
#endif
        if (esmOffH >= 96u) {
            /* Shouldn't be here... */
			/* Misra C fix 477S added to make the else part non empty */
            esmOffH = esmOffH;
        } else 
        if (esmOffH >= 64u) {
            /* Group 1 channel 32 to 63 */
        	esmChannel = esmOffH - 32u;
        	esmGroup1Handler(esmChannel);
        } else 
        if (esmOffH >= 32u) {
            /* Group 2 channel 0 to 31 */
        	esmChannel = esmOffH - 32u;
        	esmGroup2Handler(esmChannel);
        } else 
        if (esmOffH > 0u) {
            /* Group 1 channel 0 to 31 */
        	esmChannel = esmOffH;
        	esmGroup1Handler(esmChannel);
        }
        else {
            /* Shouldn't be here... */
			/* Misra C fix 477S added to make the else part non empty */
			esmOffH++;
        }
    }
    else {
        /* Shouldn't get here... */
		/* Misra C fix 477S added to make the else part non empty */
    	esmOffH++;
    }
#if FUNCTION_PROFILING_ENABLED
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    if ((esmChannel != ESM_G2ERR_B0TCM_ADDPAR) &&
    		(esmChannel != ESM_G2ERR_B1TCM_ADDPAR)) {
#endif
    	if(SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_entrytick == 0U )
    	{
        SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_entrytick = entrytick;
        SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_exittick = _sl_pmuGetCycleCount_();
    	}
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    }
#endif
#endif
}

/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_3*/
#ifdef __TI_COMPILER_VERSION__
#pragma CODE_STATE(sl_esm_low_intr_handler, 32)
#endif
#ifdef __IAR_SYSTEMS_ICC__
__arm
#endif
/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_3*/
#ifdef __TI_COMPILER_VERSION__
#pragma INTERRUPT(sl_esm_low_intr_handler, IRQ)
#endif
#ifdef __IAR_SYSTEMS_ICC__
__irq
#endif
static void sl_esm_low_intr_handler(void) {
    register uint8  esmOffL,esmChannel;
#if FUNCTION_PROFILING_ENABLED
    register uint32 entrytick=0u;
    entrytick = _sl_pmuGetCycleCount_();
#endif
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
    esmOffL = ((uint8)sl_esmREG->IOFFLR - (uint8)1u);

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    if ((esmOffL >= 128U) && (esmOffL < 160U))
    {
        /* Group 1 channel 64 to 95 */
    	esmChannel = esmOffL-64u;
    	esmGroup1Handler(esmChannel);
    }
    else {
#endif
    if ((esmOffL >= 64U) && (esmOffL < 96U))
    {
        /* Group 1 channel 32 to 63 */
    	esmChannel = esmOffL-32u;
    	esmGroup1Handler(esmChannel);
    }else if( esmOffL < 32U){
        /* Group 1 channel 0 to 31 */
    	esmChannel = esmOffL;
    	esmGroup1Handler(esmChannel);
    }
    else {
        /* Shouldn't be here... */
		/* Misra C fix 477S added to make the else part non empty */
    	esmOffL++;
    }
	#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
	}
	#endif
#if FUNCTION_PROFILING_ENABLED
   	if(SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_entrytick == 0U )
    	{
        SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_entrytick = entrytick;
        SL_Profile_Struct[SL_Active_Profile_Testtype-TESTTYPE_MIN].esm_exittick = _sl_pmuGetCycleCount_();
    	}
#endif
    return;
}

static void esmGroup2Handler (uint8 esmChannel)
{
	
    boolean cancelCallback = FALSE;
    register uint32 callbkParam1 = 0u, callbkParam2 = 0u, callbkParam3 = 0u;

    /* No need to clear ESM bit since reading ESMOFFH automatically clears the status bit */
    switch (esmChannel) {
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    	case ESM_G2ERR_L2RAMW_UNCORR_B:
    		callbackCancelCount++;
    		cancelCallback = TRUE;
    	break;

        case ESM_G2ERR_CCMR5_CPUCOMP_ERR:
            /* No additional parameters available */
        	callbkParam1 = 0u;
            /* Error is intentional due to diagnostic test - Clear the module
             * error */
            ccmr5fREG1->_CCMSR1 = CCMR5F_CCMSR_CMPE;
            /* Cancel callback if this was intentional */
            if (TRUE == SL_FLAG_GET(CCMR5F_CPUCOMP_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
            break;

        case ESM_G2ERR_CCMR5_VIMCOMP_ERR:
            /* No additional parameters available */
        	callbkParam1 = 0u;
            /* Error is intentional due to diagnostic test - Clear the module
             * error */
            ccmr5fREG1->_CCMSR2 = CCMR5F_CCMSR_CMPE;
            /* Cancel callback if this was intentional */
            if (TRUE == SL_FLAG_GET(CCMR5F_VIMCOMP_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
            break;

