pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_esm.c
        case ESM_G2ERR_CCMR5_PDCOMP_ERR:
            /* No additional parameters available */
        	callbkParam1 = 0u;
            /* Error is intentional due to diagnostic test - Clear the module
             * error */
            ccmr5fREG1->_CCMSR3 = CCMR5F_CCMSR_CMPE;
            /* Cancel callback if this was intentional */
            if (TRUE == SL_FLAG_GET(CCMR5F_PDCOMP_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
            break;

        case ESM_G2ERR_CCMR5_INMCOMP_ERR:
            /* No additional parameters available */
        	callbkParam1 = 0u;
            /* Error is intentional due to diagnostic test - Clear the module
             * error */
            ccmr5fREG1->_CCMSR4 = CCMR5F_CCMSR_CMPE;
            /* Cancel callback if this was intentional */
            if (TRUE == SL_FLAG_GET(CCMR5F_INMCOMP_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
            break;
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        case ESM_G2ERR_CCMR4_COMP:
            /* No additional parameters available */
        	callbkParam1 = 0u;
            /* Clear the module error */
            ccmr4fREG1->_CCMSR = CCMR4F_CCMSR_CMPE;
            /* Cancel callback if this was intentional */
            if (TRUE == SL_FLAG_GET(CCMR4F_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
        break;

        case ESM_G2ERR_FMC_UNCORR:
        	if (TRUE == SL_FLAG_GET(FLASH_ADDRESS_PARITY_SELF_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
            /* Flash Un-correctable error, capture the error address */
        	callbkParam1 = sl_flashWREG->FUNCERRADD;
            /* No status to clear here */
        break;

        case ESM_G2ERR_B0TCM_UNCORR:
        	if (TRUE == SL_FLAG_GET(SRAM_RADECODE_DIAGNOSTICS)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
        	callbkParam1 = sl_tcram1REG->RAMUERRADDR;
            /* No status to clear here */
        break;

        case ESM_G2ERR_B1TCM_UNCORR:
        	if (TRUE == SL_FLAG_GET(SRAM_RADECODE_DIAGNOSTICS)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
        	callbkParam1 = sl_tcram2REG->RAMUERRADDR;
            /* No status to clear here */
        break;

        case ESM_G2ERR_B0TCM_ADDPAR:
        	callbkParam1 = sl_tcram1REG->RAMPERADDR;
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
            callbkParam2 = (sl_tcram1REG->RAMERRSTATUS
                                & (TCRAM_RAMERRSTAT_WADDRPAR_FAIL | TCRAM_RAMERRSTAT_RADDRPAR_FAIL));
            callbkParam3 = (uint32) 0u;
            /* Clear the WADDR/RADDR PAR Fail bits in TCM Regs */
            break;

        case ESM_G2ERR_B1TCM_ADDPAR:
        	callbkParam1 = sl_tcram2REG->RAMPERADDR;
            /* No status to clear here */
            break;

        case ESM_G2ERR_FLASH_LIVLCK:
        	callbkParam1 = 0u;
            /* No status to clear here */
            break;

        case ESM_G2ERR_RTI_WWD_NMI:
        	callbkParam1 = 0u;
            /* No status to clear here */
        break;
#endif
        default:
            break;
    }
    /* Call application callback only if it's registered & if it's not masked */
	/* the MSB of contains information regarding group and LSB contains the esm channel number*/
    if ((0u != ESM_AppCallback) && ((FALSE) == cancelCallback)) {
    	(*(ESM_AppCallback))((uint32)(ESM_GRP2_MASK | esmChannel), callbkParam1, callbkParam2, callbkParam3);
    }
    return;
}

static
void esmGroup1Handler(uint8 esmChannel)
{
	
	
	boolean cancelCallback = FALSE;
    register uint32 callbkParam1 = 0u, callbkParam2 = 0u, callbkParam3 = 0u;

	switch (esmChannel) {
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)

        /** F021 Flash Correctabe error (bus1 & bus2) & non-EEPROM **/
		case ESM_G1ERR_FMC_CORR:
			/* Retrieve the callback parameters */
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam1 = (sl_flashWREG->FCORERRCNT & 0x0000FFFFu);
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam2 = (sl_flashWREG->FCORERRADD);
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam3 = (sl_flashWREG->FCORERRPOS & 0x000003FFu);
			break;

        /** PLL1 Slip error **/
        case ESM_G1ERR_PLL1_SLIP:
            /** Store the callback parameters & reset the status registers */
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
            callbkParam1 = (uint32)((sl_systemREG1->GBLSTAT & 0x00000300u) >> 8u);
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
            sl_systemREG1->GBLSTAT |= (sl_systemREG1->GBLSTAT & 0x00000300u);
            break;

        /** LPOCLK Detect error */
        case ESM_G1ERR_CLOCKMON_INTR: /* \todo Need to confirm the source & params */
            break;

        /** VIM Parity Error **/
        case ESM_G1ERR_VIMRAM_PARITY:
            /* Extract the parameters & clear the flag */
            callbkParam1 = SL_VIM_ADDERR;
            SL_VIM_PARFLG = 1u;
            break;

        /** B0TCM ECC Correctable error **/
        case ESM_G1ERR_B0TCM_CORRERR:
            /* Call application if this error was _not_ intentional (self-test) */
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
        	callbkParam1 = (sl_tcram1REG->RAMSERRADDR);
            break;

        /** B1TCM ECC Correctable error **/
        case ESM_G1ERR_B1TCM_CORRERR:
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
        	callbkParam1 = (sl_tcram2REG->RAMSERRADDR);
            /* Call application if this error was _not_ intentional (self-test) */
            break;

        /** DCC Error */
        case ESM_G1ERR_DCC1_ERR:
            callbkParam1 = sl_dccREG1->CNT0;
            callbkParam2 = sl_dccREG1->CNT1;
            sl_dccREG1->STAT |= DCC_DCCSTAT_ERR_FLG;
            break;
        /** CCMR4 Self-Test Compare error */
        case ESM_G1ERR_CCMR4_SELFTEST:
			/*ccmr4f selftests have has synchronous and asynchronous modes,the efuse esm errors are not blocked by disabling interrupt during selftest*/
		    /*blocking the esm application call back if the interrupt was due to a selftest*/
        	if (TRUE == SL_FLAG_GET(CCMR4F_ERROR_FORCING_TEST)) {
            	callbackCancelCount++;
            	cancelCallback = TRUE;
            }
        	break;

