pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_esm.c
        case ESM_G1ERR_EEPROM_CORRERR:
			/* Retrieve the callback parameters */
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam1 = (sl_flashWREG->EECORRERRADD);
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam2 = (sl_flashWREG->EECORRERRCNT);
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam3 = (sl_flashWREG->EECORRERRPOS & 0x000001FFu);
            /* \todo */
        	break;

        case ESM_G1ERR_EEPROM_UNCORRERR:
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
        	callbkParam1 = (sl_flashWREG->EEUNCERRADD);
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
        	callbkParam2 = (sl_flashWREG->EESTATUS);
            /* \todo */
        	break;
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
		case ESM_G1ERR_PSCON_COMPARE_ERR:
     		/*pscon selftests have has synchronous and asynchronous modes,the efuse esm errors are not blocked by disabling interrupt during selftest*/
		    /*blocking the esm application call back if the interrupt was due to a selftest*/
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			if ((PMM_PRCKEYREG_MKEY_ERRFCG_MODE == sl_pmmREG->PRCKEYREG) && (TRUE == SL_FLAG_GET(PSCON_ERROR_FORCING))) {
				cancelCallback = TRUE;
			} else {
				cancelCallback = FALSE;
			}
			/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
			callbkParam1 = (((sl_pmmREG->LPDDCSTAT1 & PMM_PSCON_LPDDCSTAT1_LCMPE) >> 16)
					/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_4*/
								| (sl_pmmREG->MPDDCSTAT1 & PMM_PSCON_MPDDCSTAT1_MCMPE));
			break;

		case ESM_G1ERR_PSCON_SELTEST_ERR:
			/*pscon selftests have has synchronous and asynchronous modes,the efuse esm errors are not blocked by disabling interrupt during selftest*/
		    /*blocking the esm application call back if the interrupt was due to a selftest*/
			if (TRUE == SL_FLAG_GET(PSCON_SELF_TEST)){
				/* Since this is a self test related error, it's always intentionally
				 * created by kicking off the ST in PRCKEYREG. Selftest API takes
				 * care of clearing this error nothing needs to be done here */
				
				cancelCallback  = TRUE;
				callbackCancelCount++;
				SL_FLAG_CLEAR(PSCON_SELF_TEST);
			}
			break;
#endif

		case ESM_G1ERR_EFUSE_SELTEST_ERR:
			/*efuse selftests have synchronous and asynchronous modes.the efuse esm errors are not blocked by disabling interrupt during selftest*/
			if ((TRUE ==  SL_FLAG_GET(EFUSE_SELF_TEST_STUCK_AT_ZERO))||(TRUE ==  SL_FLAG_GET(EFUSE_SELF_TEST_ECC))){
				/* Since this is a self test related error, it's always intentionally
				 * created by kicking off the ST in PRCKEYREG. Selftest API takes
				 * care of clearing this error nothing needs to be done here */
				
				cancelCallback  = TRUE;
				callbackCancelCount++;
				SL_FLAG_CLEAR(EFUSE_SELF_TEST_ECC);
				SL_FLAG_CLEAR(EFUSE_SELF_TEST_STUCK_AT_ZERO);
			}
			break;

		case ESM_G1ERR_EFUSE_ERR_OTHER:
			/*efuse has synchronous and asynchronous modes,the efuse esm errors are not blocked by disabling interrupt during selftest*/
		    /*blocking the esm application call back if the interrupt was due to a selftest*/
			if (TRUE ==  SL_FLAG_GET(EFUSE_SELF_TEST_ECC)){
				/* Since this is a self test related error, it's always intentionally
				 * created by kicking off the ST in PRCKEYREG. Selftest API takes
				 * care of clearing this error nothing needs to be done here */
				
				cancelCallback  = TRUE;
				callbackCancelCount++;
				SL_FLAG_CLEAR(EFUSE_SELF_TEST_ECC);
			}
			break;

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /** PLL2 Slip error **/
        case ESM_G1ERR_PLL2_SLIP:
            /** \todo Looks like no slip info is available. Double check */
        	break;

        /** DCC Error */
        case ESM_G1ERR_DCC2_ERR:
            callbkParam1 = sl_dccREG2->CNT0;
            callbkParam2 = sl_dccREG2->CNT1;
            sl_dccREG2->STAT |= DCC_DCCSTAT_ERR_FLG;
            break;
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
      	/* CCMR5 Self-Test Compare error */
        case ESM_G1ERR_CCMR5_SELFTEST:
            /*ccmr5f selftests have has synchronous and asynchronous modes,the
             * esm errors are not blocked by disabling interrupt during
             * selftest*/
            /* blocking the esm application call back if the interrupt was due to
             * a selftest.
             * NOTE: Getting here implies that the CCMR5F has an error! */
            if ((TRUE == SL_FLAG_GET(CCMR5F_CPUCOMP_SELF_TEST)) || 
                        (TRUE == SL_FLAG_GET(CCMR5F_VIMCOMP_SELF_TEST)) ||
                        (TRUE == SL_FLAG_GET(CCMR5F_PDCOMP_SELF_TEST)) ||
                        (TRUE == SL_FLAG_GET(CCMR5F_INMCOMP_SELF_TEST))) {
                /* clear the ESM Status flag */
				BIT_SET(sl_esmREG->SR1[0], BIT(ESM_G1ERR_CCMR5_SELFTEST));
                callbackCancelCount++;
              	cancelCallback = TRUE;
            }
            break;

        case ESM_G1ERR_CCMR5_OPERATING_STATUS:
        	callbackCancelCount++;
            cancelCallback = TRUE;
        	sl_esmREG->SR7[0] = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_OPERATING_STATUS);
            break;

        case ESM_G1ERR_DMA_ECC_SBERR:
        	if(TRUE == SL_FLAG_GET(DMA_ECC_TEST_MODE_1BIT)) {
        		callbackCancelCount++;
        		cancelCallback = TRUE;
        	}
        	break;

        case ESM_G1ERR_DMA_ECC_UNCORR:
        	if(TRUE == SL_FLAG_GET(DMA_ECC_TEST_MODE_2BIT)) {
        		callbackCancelCount++;
        		cancelCallback = TRUE;
        	}
        	break;

        case ESM_G1ERR_CAN1_ECC_SBERR:
        case ESM_G1ERR_CAN2_ECC_SBERR:
        case ESM_G1ERR_CAN3_ECC_SBERR:
        case ESM_G1ERR_CAN4_ECC_SBERR:
        	if(TRUE == SL_FLAG_GET(CAN_ECC_TEST_MODE_1BIT)) {
        		callbackCancelCount++;
                cancelCallback = TRUE;
            }
            break;

        case ESM_G1ERR_CAN1_ECC_UNCORR:
        case ESM_G1ERR_CAN2_ECC_UNCORR:
        case ESM_G1ERR_CAN3_ECC_UNCORR:
        case ESM_G1ERR_CAN4_ECC_UNCORR:
        	if(TRUE == SL_FLAG_GET(CAN_ECC_TEST_MODE_2BIT)) {
        		callbackCancelCount++;
        		cancelCallback = TRUE;
        	}
        	break;

        case ESM_G1ERR_SPI1_ECC_SBERR:
        case ESM_G1ERR_SPI2_ECC_SBERR:
        case ESM_G1ERR_SPI3_ECC_SBERR:
        case ESM_G1ERR_SPI4_ECC_SBERR:
        case ESM_G1ERR_SPI5_ECC_SBERR:
        	if(TRUE == SL_FLAG_GET(MIBSPI_ECC_TEST_MODE_1BIT)) {
        		callbackCancelCount++;
                cancelCallback = TRUE;
            }
            break;

        case ESM_G1ERR_SPI1_ECC_UNCORR:
        case ESM_G1ERR_SPI2_ECC_UNCORR:
        case ESM_G1ERR_SPI3_ECC_UNCORR:
        case ESM_G1ERR_SPI4_ECC_UNCORR:
        case ESM_G1ERR_SPI5_ECC_UNCORR:
        	if(TRUE == SL_FLAG_GET(MIBSPI_ECC_TEST_MODE_2BIT)) {
        		callbackCancelCount++;
        		cancelCallback = TRUE;
        	}
        	break;

#endif

        default:
			break;
	}
    /* Call application callback only if it's registered & if it's not masked */
	/* the MSB of contains information regarding group and LSB contains the esm channel number*/
    if ((0u != ESM_AppCallback) && ((FALSE) == cancelCallback)) {
        (*(ESM_AppCallback))((uint32)(ESM_GRP1_MASK|esmChannel), callbkParam1, callbkParam2, callbkParam3);
    }
return;
}

/*Comment_1:
 * "Reason -  Needed"*/

/*Comment_2:
 * "This function will be called by application so not static"*/

/*Comment_3:
 * "Reason -  used for creation of code section for interrupt handler"*/

/*Comment_4:
 * "Reason -  FALSE_POSITIVE The rule requires that the expression should be
 * guaranteed to have the same value regardless of the order in which the operands within the expression are evaluated.
 * This usually means no more than one volatile access occuring in the expression.The recommendation that simple
 * assignments should be used is intended to be restricted to simple assignments of the form x = v and not
 * "simple assignments" according to the ISO definition. However, the recommendation does not have to be followed
 * in order to be compliant with the rule. You should implement the rule (the value should be independent of the
 * evaluation order) for compliance purposes and you might choose to issue a warning for non-simple assignments
 * or you might choose to ignore them."*/
